<?php

/* 
  পিএইচ পি তে কিছু সুপার গ্লোবাল ভ্যারিয়েবল আছে 

  যেমন  $_POST $_REQUEST $_GET $_FILES $_GLOBALS

  আমরা জানি যে ফাংশন ব্যবহার করার সময় আমাদের ফাংশনে যেসকল ভ্যারিয়েবল থাকে
  তা হলো লোকাল ভ্যারিয়েবল আর লোকাল ভ্যারিয়েবল ফাংশনের বাহিরে ব্যবহার কারা যায় না

  তবে কিন্তু আমরা যদি ফাংশনের বাহিরে  ডিক্লেয়ার করা গ্লোবাল ভ্যারিয়েবল ফাংশনে ব্যবহার করতে চাই তাহলে 

  global keyword টি ভ্যারিয়েবলের নামের সামনে উল্লেখ করতে পারি

আবার সুপার গ্লোবাল ভ্যারিয়েবল যেমন  $GLOBALS['var_name']  এরকম করেও করতে পারি

মনে রাখতে হবে $_GLOBALS['var_name'] এটি ভুল আর সঠিক হলো $GLOBALS['var_name']

*/



$number = 28;
$number2 = 25;

function printNumber(){

    global $number;
    echo $number ."\n";

    echo $GLOBALS['number2'];
}

printNumber();

?>